# BuiltInFailures.BendFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..BendFailures Class
BuiltInFailures Class Members See Also
---
Failures about Bends.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class BendFailures
```

Visual Basic
---
```text
Public NotInheritable Class BendFailures
```

Visual C++
---
```text
public ref class BendFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..BendFailures
# See Also
BuiltInFailures..::..BendFailures Members
Autodesk.Revit.DB Namespace